seblee/TQ01M1/bsp/stm32f10x/drivers/usart_bsp.c
    //出水状态
    l_sys.HeatWater_st = u8Buff[1];
    //出水流量
    l_sys.HeatWater_Flow = u8Buff[3];
    l_sys.HeatWater_Flow = (l_sys.HeatWater_Flow << 8) | u8Buff[4];
    rt_kprintf("u8Buff[1]=%d,3=%d,4=%d,l_sys.HeatWater_Flow=%d\n", u8Buff[1], u8Buff[3], u8Buff[4], l_sys.HeatWater_Flow);

    return 1;
}
/*************************************************
Function:void Comm_Service(void)// 函数名称
Description:// 函数功能、性能等的描述
			执行通讯任务
			状态机转换（正常情况）: RECV_Wait->RECV_Going->RECV_Over->
                                    SEND_Wait->SEND_Going->SEND_Over->RECV_Wait
Author:xdp（作者）
Calls:// 被本函数调用的函数清单
Called By:// 调用本函数的函数清单
			main();
Input:// 输入参数说明，包括每个参数的作
    // 用、取值说明及参数间关系。
Output:// 对输出参数的说明。
Return:// 函数返回值的说明
Others:// 其它说明
*************************************************/
void Comm_Service(void)
{
    extern sys_reg_st g_sys;
    uint8_t port; //通讯通道

    //    for (port=0; port<UART_NUM; port++)
    {
        port = UART_HEAT;
        g_ComGap[port]++;

        //		rt_kprintf("g_ComStat=%d,TEST=%d\n",g_ComStat[port],g_sys.status.ComSta.TEST);
        switch (g_ComStat[port])
        {
        case RECV_Wait: //接收等待（检查接收端是否打开）-------------------------

            break;
        case RECV_Going:                                 //接收进行（由g_ComGap检查）----------------------------
            if (g_ComGap[port] > PROTOCOL_FRAME_ByteGap) //接收超时？
            {
                g_ComStat[port] = INIT_Apply; //置"初始化"状态
            }
            break;
        case RECV_Over:                                //接收完成（转换状态明确）-------------------------------
                                                       //	            xPort_Usart_Close(port);                           //关闭通讯通道
            if (!AnalyseProtocol(&g_ComBuff[port][0])) //
            {
            }
            memset(&g_ComBuff[port][0], 0x00, PROTOCOL_FRAME_MaxLen);
            g_ComStat[port] = SEND_Wait; //置"发送等待"状态
            break;
        case SEND_Wait: //发送等待（由g_ComGap检查）----------------------------
                        //	            if (g_ComGap[port]> PROTOCOL_FRAME_SendGap)               //发送延时到？
        {
            g_ComGap[port] = 0;           //通讯字节间隔定时开始
            g_ComStat[port] = SEND_Going; //置"正在发送"状态
        }
        break;
        case SEND_Going: //正在发送（检查发送端是否打开）------------------------
            if (g_ComGap[port] < 100)
            {
                break;
            }
        case SEND_Over:
        case INIT_Apply:                 //接收错误----------------------------------------------
        default:                         //其他状态------------------------------------------------------
                                         //	          xPort_Usart_Init(port);          //通道初始化（复位）
            g_ComStat[port] = RECV_Wait; //置"接收等待"状态
                                         //							memset(&g_ComBuff[port][0],0x00,PROTOCOL_FRAME_MaxLen);
            break;
        }
    }
    return;
}

//加热器串口接收数据
uint8_t HeatPortSerialReceiveFSM(uint8_t port)
{
    extern sys_reg_st g_sys;
    uint8_t RXDByte;
    uint16_t u16CheckSum;

    g_sys.status.ComSta.TEST |= 0x01;
    /* Always read the character. */
    (void)xPortSerialGetByte((char *)&RXDByte, port);
    g_ComGap[port] = 0;
    switch (Protocol[port].StatckStatus)
    {
    case PROTOCOL_STACK_IDLE:
        // 空闲状态,等待接收帧首字符(01)
        //		    if ((g_ComStat[port]==RECV_Wait)                        //当前正"接收等待"
        //		    &&(0x01== RXDByte))
        if (0x01 == RXDByte)
        {
            g_ComStat[port] = RECV_Going; //置"接收进行"状态
            g_ComBuff[port][0] = RXDByte;
            u16FrameCheckSum = RXDByte;
            Protocol[port].DataCount = 1;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x02;
            g_sys.status.ComSta.TEST4 = u16FrameCheckSum;
        }
        break;
    case PROTOCOL_STACK_CK:
        if ((HEAT_OPEN == RXDByte) //当前正"接收等待"
            || (HEAT_CLOSE == RXDByte))
        {
            // 累加校验和
            u16FrameCheckSum += RXDByte;
            g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
            u8FrameDataLength = 14;
            Protocol[port].StatckStatus++;
            g_sys.status.ComSta.TEST |= 0x04;
        }
        else
        {
            // 帧错误,协议解析复位
            Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
            g_ComStat[port] = INIT_Apply; //置"发送等待"状态
        }
        g_sys.status.ComSta.TEST5 = u16FrameCheckSum;
        break;
    case PROTOCOL_STACK_RCV:
        // 累加校验和
        u16FrameCheckSum += RXDByte;
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            // 接收校验和
            g_sys.status.ComSta.TEST6 = u16FrameCheckSum;
            u8FrameDataLength = 2;
            Protocol[port].StatckStatus++;
        }
        g_sys.status.ComSta.TEST |= 0x08;
        break;
    case PROTOCOL_STACK_CS:
        g_ComBuff[port][(Protocol[port].DataCount)++] = RXDByte;
        u8FrameDataLength--;
        // 接收数据域的数据
        if (!u8FrameDataLength)
        {
            g_sys.status.ComSta.TEST |= 0x10;
            // 接收校验和
            u16CheckSum = g_ComBuff[port][16];
            u16CheckSum = (u16CheckSum << 8) | g_ComBuff[port][17];
            g_sys.status.ComSta.TEST2 = u16FrameCheckSum;
            g_sys.status.ComSta.TEST3 = u16CheckSum;
            if (u16CheckSum == u16FrameCheckSum)
            {
                g_sys.status.ComSta.TEST |= 0x20;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = RECV_Over; //置"接收完成"状态
            }
            else
            {
                // 校验和不正确,协议解析复位
                g_sys.status.ComSta.TEST |= 0x40;
                Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
                g_ComStat[port] = INIT_Apply; //置"初始化"状态
            }
        }
        break;
    case PROTOCOL_STACK_END:

        break;
    default:
        Protocol[port].StatckStatus = PROTOCOL_STACK_IDLE;
        g_ComStat[port] = INIT_Apply; //置"初始化"状态
        break;
    }
    return 1;
}

void USART1_IRQHandler(void)
{

    rt_interrupt_enter();
    //溢出错误
    if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) == SET)
    {
        ;
    }
    //接收中断
    if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
    {
        HeatPortSerialReceiveFSM(UART_HEAT);
        USART_ClearITPendingBit(USART1, USART_IT_RXNE);
    }
    //发送中断
    if (USART_GetITStatus(USART1, USART_IT_TXE) == SET)
    {
        ;
    }
    rt_interrupt_leave();
}
